app/views/forums/index.html.erb

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `topics` WHERE (`topics`.forum_id = 1)) AS subquery
SELECT `topics`.* FROM `topics` WHERE (forum_id=1)
---

  <td><%=forum.topics.size %></td>