app/views/devise/registrations/edit.html.erb

    <%= f.label :state %>
    <%= f.select :state, options_for_select(User.state_all, :selected=>resource.state) %>
---
SELECT `states`.* FROM `states`