app/views/devise/registrations/new.html.erb

<%= f.label "Registration as" %>
<%= f.radio_button  "role_id", Role.find_by_role_type("Consultant").id, :checked=>true  %> Consultant
---
SELECT `roles`.* FROM `roles` WHERE (`roles`.`role_type` = 'Consultant') LIMIT 1