app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT `contacts`.* FROM `contacts`

  def show
    @contact = Contact.find(params[:id])
---
SELECT `contacts`.* FROM `contacts` WHERE (`contacts`.`id` = 1) LIMIT 1

  def edit
    @contact = Contact.find(params[:id])
---
SELECT `contacts`.* FROM `contacts` WHERE (`contacts`.`id` = 1) LIMIT 1

  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save
---
INSERT INTO `contacts` (`company_name`, `created_at`, `description`, `email`, `mobile_number`, `name`, `subject`, `updated_at`) VALUES ('railsfactory', '2012-04-19 04:21:54', 'shcwhhfui uwhudiwdh dgdg ege', 'nethaji@railsfactory.org', 9629249662, 'nethaji', 'request for test', '2012-04-19 04:21:54')

  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])
---
SELECT `contacts`.* FROM `contacts` WHERE (`contacts`.`id` = 1) LIMIT 1
UPDATE `contacts` SET `description` = 'shcwhhfui uwhudiwdh dgdg egefvsd', `updated_at` = '2012-04-19 04:22:41' WHERE (`contacts`.`id` = 1)

  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy
---
SELECT `contacts`.* FROM `contacts` WHERE (`contacts`.`id` = 1) LIMIT 1
DELETE FROM `contacts` WHERE (`contacts`.`id` = 1)