app/controllers/forums_controller.rb

 def create
  @forum = Forum.new(params[:forum])
    respond_to do |format|
    if @forum.save
---
INSERT INTO `forums` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2012-04-19 09:42:51', 'blah blah blah blah blah blah blah blah blah blah blah blah blah blah ', 'forum 1', '2012-04-19 09:42:51')

 def show
 @results=Topic.find(:first)
 @forum=Forum.find(params[:id])
---
SELECT `topics`.* FROM `topics` WHERE (`topics`.forum_id = 1)
SELECT `forums`.* FROM `forums` WHERE (`forums`.`id` = 1) LIMIT 1