app/controllers/mailbox_controller.rb

  def show
    @folder ||= current_user.folders.find(params[:id])
---
SELECT `folders`.* FROM `folders` WHERE (`folders`.user_id = 16) AND (`folders`.`id` = 0) LIMIT 1