app/controllers/tcoms_controller.rb

SELECT `tcoms`.* FROM `tcoms` WHERE (`tcoms`.user_id = 7) LIMIT 1
---
  def index
    @tcoms = Tcom.all

SELECT `tcoms`.* FROM `tcoms` WHERE (`tcoms`.user_id = 7) LIMIT 1
---
  def show
    @tcom = Tcom.find(params[:id])

SELECT `tcoms`.* FROM `tcoms` WHERE (`tcoms`.user_id = 7) LIMIT 1
---
  def edit
    @tcom = Tcom.find(params[:id])

INSERT INTO `tcoms` (`address`, `alternative_phone`, `business_email`, `business_phone`, `business_start_date`, `business_structure`, `business_type_id`, `city`, `classifications`, `company_name`, `contract_experience`, `created_at`, `customer_focus`, `duns`, `facility_clearance`, `industry_focus`, `keywords`, `naics`, `no_of_employee`, `product_and_service`, `title`, `updated_at`, `user_id`, `website`, `youtube_video`, `zipcode`) VALUES ('fgdcjh tydftyf qgyfhjq qtysdtyqfvghvg', 87456135431, 'nethaji@railsfactory.org', 89564513546, '1903-03-02', 'gfvghvc', 4, 'gcghfqgv', NULL, 'test company', 'No', '2012-04-19 03:54:28', 'fdg', 'gfgvgcv', 'No', 'vc', 'ygf', NULL, 56476, 'ghfhjbjhgf', 'test', '2012-04-19 03:54:28', 1, 'http://www.blogboss.heroku.com', NULL, 564685)
---
  def create
    @tcom = Tcom.new(params[:tcom])

    respond_to do |format|
      if @tcom.save

SELECT `tcoms`.* FROM `tcoms` WHERE (`tcoms`.user_id = 7) LIMIT 1
UPDATE `tcoms` SET `business_type_id` = 1, `contract_experience` = 'Yes', `facility_clearance` = 'Yes', `updated_at` = '2012-04-19 05:30:40' WHERE (`tcoms`.`id` = 1)
---
  def update
    @tcom = Tcom.find(params[:id])

    respond_to do |format|
      if @tcom.update_attributes(params[:tcom])